### 3. تفاوت مجموع درآمد افراد دانشگاهی و غیر دانشگاهی

In [3]:
import numpy as np
import pandas as pd

In [4]:
def get_total_job_income(df, member_id):
    return df[df['Member_id'] == member_id]['netincome_w_y'].apply(to_int).sum()


def to_int(num):
    try:
        if type(num) == str:
            num = num.strip()
        return int(num)
    except Exception as e:
        return 0


def calc_total_person_income(file_name):
    df_job_income = pd.read_excel(file_name, engine='openpyxl', sheet_name=file_name.split('.')[0] + 'P4S01')

    df_job_income['Member_id'] = df_job_income.apply(lambda r: str(r['Address']) + '_' + str(int(r['member'])), axis=1)
    df_job_income['income'] = df_job_income.apply(lambda r: get_total_job_income(df_job_income, r['Member_id']), axis=1)
    df_job_income.drop_duplicates(subset=['Member_id'], inplace=True)
    df_job_income.rename({'netincome_w_y': 'income'}, inplace=True, axis=1)
    df_job_income = df_job_income[['Member_id', 'income']]

    return df_job_income

In [5]:
R98_income = calc_total_person_income('R98.xlsx')
R98_income

         Member_id     income     income
0  20011395420.0_1  130000000  130000000
1  20001385412.0_1  102400000  102400000
2  20011395423.0_1   45000000   45000000
3  20005389018.0_1   40000000   40000000
4  20013397808.0_1   45000000   45000000